; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-4-3-8)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 robot4 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 rgripper4 lgripper4 - gripper
room1 room2 room3 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 - object)
(:init
(at-robby robot1 room3)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room2)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room1)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at-robby robot4 room3)
(free robot4 rgripper4)
(free robot4 lgripper4)
(at ball1 room3)
(at ball2 room1)
(at ball3 room3)
(at ball4 room1)
(at ball5 room3)
(at ball6 room1)
(at ball7 room3)
(at ball8 room2)
)
(:goal
(and
(at ball1 room1)
(at ball2 room1)
(at ball3 room2)
(at ball4 room3)
(at ball5 room3)
(at ball6 room2)
(at ball7 room1)
(at ball8 room2)
)
)
)

; plan
1. (pick robot3 ball6 room1 lgripper3)
   deleted: (at ball6 room1) (free robot3 lgripper3)
   added: (carry robot3 ball6 lgripper3)
   goals met: 3 of 8
2. (pick robot3 ball4 room1 rgripper3)
   deleted: (at ball4 room1) (free robot3 rgripper3)
   added: (carry robot3 ball4 rgripper3)
   goals met: 3 of 8
3. (pick robot1 ball3 room3 lgripper1)
   deleted: (at ball3 room3) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 3 of 8
4. (pick robot4 ball7 room3 lgripper4)
   deleted: (at ball7 room3) (free robot4 lgripper4)
   added: (carry robot4 ball7 lgripper4)
   goals met: 3 of 8
5. (pick robot4 ball1 room3 rgripper4)
   deleted: (at ball1 room3) (free robot4 rgripper4)
   added: (carry robot4 ball1 rgripper4)
   goals met: 3 of 8
6. (move robot3 room1 room3)
   deleted: (at-robby robot3 room1)
   added: (at-robby robot3 room3)
   goals met: 3 of 8
7. (move robot1 room3 room2)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room2)
   goals met: 3 of 8
8. (move robot4 room3 room1)
   deleted: (at-robby robot4 room3)
   added: (at-robby robot4 room1)
   goals met: 3 of 8
9. (drop robot3 ball4 room3 rgripper3)
   deleted: (carry robot3 ball4 rgripper3)
   added: (at ball4 room3) (free robot3 rgripper3)
   goals met: 4 of 8
10. (drop robot1 ball3 room2 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room2) (free robot1 lgripper1)
   goals met: 5 of 8
11. (drop robot4 ball7 room1 lgripper4)
   deleted: (carry robot4 ball7 lgripper4)
   added: (at ball7 room1) (free robot4 lgripper4)
   goals met: 6 of 8
12. (drop robot4 ball1 room1 rgripper4)
   deleted: (carry robot4 ball1 rgripper4)
   added: (at ball1 room1) (free robot4 rgripper4)
   goals met: 7 of 8
13. (move robot3 room3 room2)
   deleted: (at-robby robot3 room3)
   added: (at-robby robot3 room2)
   goals met: 7 of 8
14. (drop robot3 ball6 room2 lgripper3)
   deleted: (carry robot3 ball6 lgripper3)
   added: (at ball6 room2) (free robot3 lgripper3)
   goals met: 8 of 8
